{
  "tecnologia": [
    {
      "domanda": "Quale dei seguenti è un linguaggio di codifica noto anche come termine per caffè? \n (a) Java \n (b) Joe \n (c) CoffeeBean \n (d) Nessuna delle risposte precedenti \n ",
      "risposta": "a",
      "info": "Java è stato progettato per avere l'aspetto del linguaggio di programmazione C++, ma è più semplice da usare e applica un modello di programmazione orientato agli oggetti. Java può essere utilizzato per creare applicazioni complete che possono essere eseguite su un singolo computer o essere distribuito tra server e client in una rete."
    },
    {
      "domanda": "Qual è stato il primo computer elettronico di successo al mondo? \n (a) PARAM \n (b) CRAY-1 \n (c) Pascaline \n (d) ENIAC (Electronic Numerical Integrator And Computer) \n",
      "risposta": "d",
      "info": "Electronic Numerical Integrator and Calculator è stato il primo computer elettronico generico. Era Turing-completo, digitale e in grado di risolvere una vasta classe di problemi numerici attraverso la riprogrammazione."
    },
    {
      "domanda": "Come viene misurata la qualità di una stampante? \n (a) Alfabeto per battito \n (b) Parole per pollice \n (c) Colpi per pollice \n (d) Punti per pollice \n",
      "risposta": "d",
      "info": "Nella stampa, DPI (punti per pollice) si riferisce alla risoluzione di output di una stampante o fotounità e PPI (pixel per pollice) si riferisce alla risoluzione di input di una fotografia o di un'immagine. DPI si riferisce alla densità fisica dei punti di un'immagine quando è riprodotta come un'entità fisica reale, ad esempio stampata su carta."
    },
    {
      "domanda": "Chi ha sviluppato Yahoo? \n (a) Dennis Ritchie e Ken Thompson \n (b) David Filo e Jerry Yang \n (c) Vint Cerf e Robert Kahn \n (d) Steve Case e Jeff Bezos \n ",
      "risposta": "b",
      "info": "Yahoo! è stato avviato alla Stanford University. È stato fondato nel gennaio 1994 da Jerry Yang e David Filo, che erano studenti laureati in ingegneria elettrica quando hanno creato un sito web chiamato Jerry and David's Guide to the World Wide Web."
    },
    {
      "domanda": "Qual è l'ultima versione di Android? \n (a) Oreo \n (b) Nougat \n (c) Pie \n (d) Lollipop \n",
      "risposta": "c",
      "info": "L'ultima versione di Android è la 9.0, Pie. La versione iniziale di Android Pie (9.0) è stata rilasciata il 6 agosto 2018 sui dispositivi Pixel."
    },
    {
      "domanda": "Qual è stato il primo motore di ricerca su Internet \n (a) Google \n (b) Archie \n (c) Nemo \n (d) Intel \n",
      "risposta": "b",
      "info": "Uno dei primi motori di ricerca è stato archie (1990). Archie era un motore di ricerca progettato specificamente per l'indicizzazione di archivi FTP."
    },
    {
      "domanda": "Numero di bit utilizzato dall'indirizzo IPv6 \n (a) 32bit \n (b) 64bit \n (c) 128bit \n (d) 256bit \n",
      "risposta": "c",
      "info": "Gli indirizzi IPv6 sono lunghi 128 bit."
    },
    {
      "domanda": "Qual è il primo browser web inventato nel 1990 \n (a) Internet Explorer \n (b) Mosaic \n (c) Mozilla Firefox \n (d) Nexus \n",
      "risposta": "d",
      "info": "WorldWideWeb è il primo browser web sviluppato nel 1990 in Objective-C. Successivamente, WorldWideWeb è stato rinominato Nexus per rendere più chiara la differenza per il World Wide Web."
    },
    {
      "domanda": "Quale dei seguenti non è un sistema operativo \n (a) DOS \n (b) macOS \n (c) C \n (d) Linux \n",
      "risposta": "c",
      "info": "C è un linguaggio di programmazione e non un sistema operativo."
    },
    {
      "domanda": "1024 bit è uguale a quanti byte \n (a) 1Byte \n (b) 128Byte \n (c) 32Byte \n (d) 64Byte \n",
      "risposta": "b",
      "info": "1024 bit sono 128 byte. Pertanto è un byte otto bit."
    },
    {
      "domanda": ".gif è un'estensione di \n (a) File immagine \n (b) File video \n (c) File audio \n (d) file word \n",
      "risposta": "a",
      "info": "gif sta per Graphics Interchange Format."
    },
    {
      "domanda": "Dove si trova la sede principale dell'ufficio Microsoft \n (a) Texas \n (b) NewYork \n (c) California \n (d) Washington \n",
      "risposta": "d",
      "info": "Il quartier generale di Mircosoft si trova a Washington."
    },
    {
      "domanda": "Il sistema operativo Mac è sviluppato dalla società \n (a) IBM \n (b) Apple \n (c) Microsoft \n (d) Samsung \n",
      "risposta": "b",
      "info": "Il sistema operativo desktop macOS, precedentemente Mac OS X e OS X, è sviluppato da Apple."
    },
    {
      "domanda": "Quale dei seguenti non è un software di gestione di database \n (a) MySQL \n (b) Oracle \n (c) Sybase \n (d) COBOL \n",
      "risposta": "d",
      "info": "COBOL è un linguaggio di programmazione e non un software di gestione."
    },
    {
      "domanda": "Viene utilizzato un firewall per \n (a) Sicurezza \n (b) Trasmissione dati \n (c) 32Byte \n (d) 64Byte \n",
      "risposta": "a",
      "info": "Un firewall protegge una rete da accessi di rete indesiderati."
    },
    {
      "domanda": "Quale dei seguenti ha lanciato il primo servizio audio indiano 'Suno'? \n (a) Netflix \n (b) Google \n (c) Audible \n (d) Facebook \n",
      "risposta": "c",
      "info": "Audible, una parte del gigante dell'e-commerce Amazon, il 12 dicembre ha lanciato il primo servizio audio in India Suno. Audible Suno, che sarà disponibile tramite un'app Android separata, fornisce accesso gratuito e senza pubblicità a centinaia di ore di intrattenimento audio originale in hindi e inglese. "
    },
    {
      "domanda": "Scienziati da quale istituto hanno sviluppato il più grande chip per computer utilizzando nanotubi di carbonio (CNT) - RV16XNano? \n (a) Yale \n (b) MIT \n (c) Harvard \n (d) Stanford \n ",
      "risposta": "b",
      "info": "Gli scienziati del Massachusetts Institute of Technology (MIT), Cambridge, USA, hanno sviluppato il più grande chip per computer mai realizzato utilizzando nanotubi di carbonio (CNT) - RV16XNano. Questo è stato pubblicato sulla rivista Nature.RV16X-Nano è un Processore a 16 bit che contiene 14.000 transistor - interruttori elettronici. Questi interruttori sono costituiti da CNT, minuscoli cilindri fatti di fogli di grafene arrotolati e spessi un atomo. "
    },
    {
      "domanda": "Facebook lancia la criptovaluta che consente agli utenti di effettuare transazioni finanziarie in tutto il mondo. Si chiama: \n (a) Dobil \n (b) Libra \n (c) Cryco \n (d) Digicy \n",
      "risposta": "b",
      "info": "Facebook ha annunciato una valuta digitale chiamata Libra che consentirà ai suoi miliardi di utenti di effettuare transazioni finanziarie in tutto il mondo. Libra viene pubblicizzata come un mezzo per connettere le persone che non hanno accesso alle piattaforme bancarie tradizionali. Tecnologia per effettuare transazioni con Libra sarà disponibile come app standalone, oltre che sulle piattaforme WhatsApp e Facebook Messenger, già nel 2020. "
    },
    {
      "domanda": "AntBot è il primo robot ambulante ad avere capacità di navigazione senza GPS o mappatura. Chi lo ha progettato ?: \n (a) NREC \n (b) Adaptive Systems Research Group dell'Università dell'Hertfordshire \n (c) CNRS & AMU \n (d) The University of Tokyo \n ",
      "risposta": "c",
      "info": "AntBot è il primo robot ambulante ad avere capacità di navigazione senza GPS o mappatura. È stato progettato dal Centro nazionale francese per la ricerca scientifica (CNRS) e dai ricercatori dell'ISM dell'Università di Aix-Marseille, su linee simili alle formiche del deserto che utilizza luci polarizzate e radiazioni UV per navigare nello spazio. Consiste in una bussola ottica che determina i suoi movimenti con l'aiuto di una luce polarizzata. Un sensore di movimento ottico diretto al sole viene utilizzato per misurare la distanza percorsa. Fornisce una precisione di fino a 1 cm dopo aver coperto una distanza totale di 14 metri. Ha sei piedi per migliorare la mobilità e facilitare i movimenti in ambienti complessi. La bussola celeste viene utilizzata per misurare la sua direzione con precisione in caso di tempo nuvoloso o sereno. "
    },
    {
      "domanda": "Quale protocollo fornisce servizi di posta elettronica tra diversi host: \n (a) FTP \n (b) TELNET \n (c) SMTP \n (d) SNMP \n",
      "risposta": "c",
      "info": "SMTP (Simple Mail Transfer Protocol) è un protocollo TCP / IP utilizzato per inviare e ricevere e-mail. Tuttavia, poiché è limitato nella sua capacità di accodare i messaggi all'estremità ricevente, viene solitamente utilizzato con uno di altri due protocolli, POP3 o IMAP che consentono all'utente di salvare i messaggi in una cassetta postale del server e scaricarli periodicamente dal server. SMTP di solito è implementato per funzionare sulla porta Internet 25. Molti server di posta ora supportano il protocollo ESMTP (Extended Simple Mail Transfer Protocol) , che consente di inviare file multimediali come posta elettronica. "
    },
    {
      "domanda": "L'architettura di base di un computer è stata progettata da: \n (a) John Von Neumann \n (b) Charles Babbage \n (c) Blaise Pascal \n (d) Garden Moore \n",
      "risposta": "a",
      "info": "Nel 1945, il professor J. von Neumann, che allora lavorava alla Moore School of Engineering di Filadelfia, dove era stata costruita l'ENIAC, pubblicò a nome di un gruppo di suoi collaboratori un rapporto sul progettazione logica dei computer digitali. "
    },
    {
      "domanda": "Quale delle seguenti memorie è volatile ?: \n (a) EPROM \n (b) PROM \n (c) ROM \n (d) RAM \n",
      "risposta": "d",
      "info": "La RAM è normalmente associata a tipi di memoria volatili (come i moduli DRAM), dove le informazioni memorizzate vengono perse se l'alimentazione viene rimossa"
    },
    {
      "domanda": "Il formato AVI (Audio Video Interleave) è stato sviluppato da? \n (a) IBM \n (b) Microsoft \n (c) Adobe \n (d) Apple \n",
      "risposta": "b",
      "info": "Audio Video Interleave (anche Audio Video Interleaved), noto con le iniziali AVI, è un formato contenitore multimediale introdotto da Microsoft nel novembre 1992 come parte del suo software Video per Windows. I file AVI possono contenere dati sia audio che video in un contenitore di file che consente la riproduzione sincrona di audio con video "
    },
    {
      "domanda": "Quale comando viene utilizzato per rimuovere una directory su Linux ?: \n (a) rdir \n (b) remove \n (c) rd \n (d) rmdir \n",
      "risposta": "d",
      "info": "Il comando rmdir viene utilizzato rimuove le directory vuote dal filesystem in Linux. Il comando rmdir rimuove ogni directory specificata nella riga di comando solo se queste directory sono vuote."
    },
    {
      "domanda": "In un'applicazione Javascript quale funzione può essere utilizzata per inviare messaggi agli utenti che richiedono un input di testo ?: \n (a) Prompt () \n (b) Display () \n (c) GetOutpu () \n (d) Avviso () \n ",
      "risposta": "a",
      "info": "Il metodo prompt () visualizza una finestra di dialogo che richiede un input al visitatore."
    },
    {
      "domanda": "Tegra, Tesla, GeForce e nForce sono serie per chipset integrati di quale azienda ?: \n (a) AMD \n (b) Redpine \n (c) NVIDIA \n (d) Intel \n",
      "risposta": "c",
      "info": "Nvidia Corporation comunemente denominata Nvidia (ufficialmente scritta come NVIDIA e stilizzata nel logo come nVIDIA con la 'n' minuscola della stessa altezza della 'VIDIA' maiuscola; precedentemente stilizzata come nVIDIA con una grande 'n minuscola in corsivo sui prodotti dalla metà degli anni '90 all'inizio della metà degli anni 2000), è una società tecnologica americana costituita nel Delaware e con sede a Santa Clara, California. Progetta unità di elaborazione grafica (GPU) per i mercati dei giochi e professionali, nonché sistemi su un chip unit (SoC) per il mobile computing e il mercato automobilistico come Tegra, Tesla, ecc. "
    },
    {
      "domanda": "Qual era il predecessore di Wikipedia ?: \n (a) WikiLeaks \n (b) Nupedia \n (c) Unciclopedia \n (d) BritannicaOnline \n",
      "risposta": "b",
      "info": "Usando i soldi di dot.com BomisOffsite Link, il 9 marzo 2000 l'imprenditore americano Jimmy Wales Offsite Link ha fondato l'enciclopedia web, NupediaOffsite Link a San Diego, California, assumendo il filosofo Larry Sanger Offsite Link come redattore capo . A differenza di Wikipedia, Nupedia non era un wiki; era invece caratterizzato da un ampio processo di peer review, progettato per rendere i suoi articoli di una qualità paragonabile a quella delle enciclopedie professionali. "
    },
    {
      "domanda": "In quale anno il segno @ è stato scelto per il suo utilizzo nell'indirizzo e-mail: \n (a) 1972 \n (b) 1977 \n (c) 1980 \n (d) 1976 \n ",
      "risposta": "a",
      "info": "Ray Tomlinson ha inventato la posta elettronica nel 1972. Come molti degli inventori di Internet, Tomlinson ha lavorato per Bolt Beranek e Newman come appaltatore ARPANET. Ha scelto il simbolo @ dalla tastiera del computer per indicare l'invio di messaggi da un computer a un altro. Quindi, per chiunque usasse gli standard Internet, si trattava semplicemente di nominare nome-dell'utente @ nome-del-computer. Il pioniere di Internet Jon Postel, di cui sentiremo parlare più avanti, era uno dei primi utenti del nuovo sistema, ed è accreditato di descriverlo come un  bel trucco. Certamente lo era, ed è durato fino ad oggi. "
    },
    {
      "domanda": "Qual è il numero massimo di partizioni primarie che possono essere create su un disco rigido \n (a) 2 \n (b) 4 \n (c) 3 \n (d) 1 \n",
      "risposta": "b",
      "info": "Su un disco che utilizza il formato MBR tradizionale, la tabella delle partizioni ha quattro slot. Ciascuno può contenere una partizione 'primaria' oppure una può essere utilizzata per creare una partizione 'estesa' che può contenere un numero qualsiasi di partizioni (spesso chiamate 'unità logiche'). "
    },
    {
      "domanda": "Il numero totale di pin in una porta parallela tradizionale è: \n (a) 5 \n (b) 14 \n (c) 25 \n (d) 27 \n",
      "risposta": "c",
      "info": "Un connettore per porta parallela standard ha due file di 25 pin in totale circondate da un involucro di metallo. È largo circa un pollice e ha due connettori a vite per mantenere il cavo in posizione."
    },
    {
      "domanda": "Cosa misura FLOPS ?: \n (a) Operazioni in virgola mobile \n (b) Frequenza di oscillazione \n (c) Tentativi di accesso esterno \n (d) Salti di rete \n",
      "risposta": "a",
      "info": "FLOPS sta per 'Floating Point Operations Per Second' e sono tipicamente utilizzati per misurare le prestazioni del processore di un computer. Mentre la velocità di clock, misurata in megahertz, è spesso vista come un indicatore o la velocità di un processore, non definisce quanti calcoli un processore può eseguire al secondo."
    },
    {
      "domanda": "JSON è spesso visto come un'alternativa a quale lingua?: \n (a) JSP \n (b) PHP \n (c) HTML \n (d) XML \n ",
      "risposta": "d",
      "info": "JSON è un formato di scambio di dati basato su testo progettato per la trasmissione di dati strutturati. È più comunemente utilizzato per il trasferimento di dati tra applicazioni web e server web. JSON è spesso visto come un'alternativa a XML, un altro scambio di dati in testo semplice formato. Nella maggior parte dei casi, la rappresentazione JSON di un oggetto è più compatta della rappresentazione XML perché non richiede tag per ogni elemento."
    },
    {
      "domanda": "Quale persona seleziona e configura i computer per un'organizzazione ?: \n (a) Amministratore di sistema \n (b) Utente finale \n (c) Webmaster \n (d) Analista di sistema \n",
      "risposta": "d",
      "info": "Un analista di sistema è la persona che seleziona e configura i sistemi informatici per un'organizzazione o un'azienda. Il suo lavoro inizia in genere con la determinazione dello scopo previsto dei computer. Ciò significa che l'analista deve comprendere gli obiettivi generali dell'azienda , oltre a ciò che richiede il lavoro di ogni singolo utente. Una volta che l'analista di sistema ha determinato le esigenze generali e specifiche dell'azienda, può scegliere i sistemi appropriati che aiuteranno a raggiungere gli obiettivi dell'azienda."
    },
    {
      "domanda": "UTF-8 e UTF-16 sono versioni diverse di quale tipo di codifica dei caratteri ?: \n (a) ASCII \n (b) Unicode \n (c) Latino \n (d) Binario \n",
      "risposta": "b",
      "info": "Sia UTF-8 che UTF-16 sono codifiche a lunghezza variabile, dove il numero di byte utilizzati dipende dai punti di codice Unicode. D'altra parte UTF-32 è una codifica a larghezza fissa, dove ogni punto di codice richiede 4 byte."
    },
    {
      "domanda": "<body> e <head> sono esempi di cosa ?: \n (a) tag HTML \n (b) Funzioni HTML \n (c) formati HTML \n (d) protocolli HTML \n",
      "risposta": "a",
      "info": "Un file HTML è diviso in due sezioni fondamentali: la testa e il corpo, ciascuna delimitata dai rispettivi tag."
    },
    {
      "domanda": "ECC è un tipo di quale componente hardware ?: \n (a) CPU \n (b) SSD \n (c) HDD \n (d) RAM \n",
      "risposta": "d",
      "info": "EEC sta per Error Correction Code. L'ECC viene utilizzato per verificare le trasmissioni di dati individuando e correggendo gli errori di trasmissione. Viene comunemente utilizzato dai chip RAM che includono la correzione degli errori in avanti (FEC), che garantisce che tutti i dati inviati da e verso la RAM vengano trasmessi correttamente. "
    },
    {
      "domanda": "El Capitan è stato un perfezionamento di quale versione precedente del sistema operativo desktop di Apple ?: \n (a) Mojave \n (b) Sierra \n (c) Yosemite \n (d) High Sierra \n",
      "risposta": "d",
      "info": "El Capitan è la dodicesima versione di Apple OS X, nota anche come OS X 10.11. È stata rilasciata il 30 settembre 2015 ed è succeduta a OS X 10.10 Yosemite. È stata seguita da OS X 10.12 Sierra."
    },
    {
      "domanda": "Quale tecnologia Windows è stata sviluppata per sfruttare la GPU di un computer ?: \n (a) NTFS \n (b) WDDM \n (c) ActiveX \n (d) WINS \n",
      "risposta": "b",
      "info": "WDDM sta per 'Windows Display Driver Model'. WDDM è un'architettura del driver video introdotta con Windows Vista. Migliora le prestazioni grafiche rispetto alla precedente architettura di Windows XP utilizzando più pienamente la GPU di un computer per il rendering della grafica di sistema."
    },
    {
      "domanda": "Un'interfaccia della riga di comando può anche essere chiamata come ?: \n (a) GUI \n (b) Shell \n (c) NUI \n (d) Portal \n",
      "risposta": "b",
      "info": "Una shell è un programma software che interpreta i comandi dell'utente in modo che il sistema operativo possa comprenderli ed eseguire le funzioni appropriate. La shell è un'interfaccia a riga di comando, il che significa che è esclusivamente basata su testo. l'utente può digitare comandi per eseguire funzioni come eseguire programmi, aprire e sfogliare directory e visualizzare i processi attualmente in esecuzione."
    },
    {
      "domanda": "Quanti terminali ha un diodo ?: \n (a) 2 \n (b) 1 \n (c) 3 \n (d) 4 \n",
      "risposta": "a",
      "info": "Un diodo è un componente elettrico progettato per condurre corrente elettrica in una sola direzione. Ha due estremità (o terminali), ciascuna con un elettrodo di una carica diversa. L'estremità 'anodo' ha una carica positiva rispetto a l'estremità del catodo caricata negativamente. La corrente fluisce naturalmente nella direzione dall'anodo al catodo."
    },
    {
      "domanda": "Un file server è un esempio di cosa ?: \n (a) Saas \n (b) NAS \n (c) BIOS \n (d) WINS \n",
      "risposta": "b",
      "info": "NAS sta per 'Network Attached Storage'. Un tipico computer memorizza i dati utilizzando dischi rigidi interni ed esterni. Se il computer è connesso a una rete, può condividere i dati sul suodischi rigidi collegati con altri sistemi sulla rete. Sebbene ciò consenta a più computer di inviare dati avanti e indietro, richiede che ogni computer condivida i propri file individualmente."
    },
    {
      "domanda": "Quale delle seguenti affermazioni sul tipo di dati Enum è vera ?: \n (a) È il modo più efficiente per memorizzare numeri interi. \n (b) Non può memorizzare stringhe. \n (c) It può contenere un elenco di valori specifici. \n (d) È pensato specificamente per i dati binari. \n ",
      "risposta": "c",
      "info": "Enum, abbreviazione di 'enumerated', è un tipo di dati costituito da valori predefiniti. Una costante o una variabile definita come enum può memorizzare uno dei valori elencati nella dichiarazione enum."
    },
    {
      "domanda": "A cosa serve un URI ?: \n (a) Fornisce un modo standard per individuare i file. \n (b) Impedisce che i file vengano eliminati accidentalmente. \n (c) Traduce i dati dei file binari in testo normale. \n (d) Associa un programma predefinito a un tipo di file. \n",
      "risposta": "a",
      "info": "URI sta per Uniform Resource Identifier . Un URI identifica il nome e la posizione di un file o di una risorsa in un formato uniforme. Include una stringa di caratteri per il nome del file e può anche contenere il percorso della directory di il file. Gli URI forniscono un modo standard per l'accesso alle risorse da parte di altri computer su una rete o sul World Wide Web."
    },
    {
      "domanda": "Come si chiamano anche grandi quantità di dati utilizzati nelle impostazioni aziendali ?: \n (a) Fat data \n (b) Big data \n (c) Bulk Data \n (d) Heavy data \n",
      "risposta": "b",
      "info": "La frase big data viene spesso utilizzata nelle impostazioni aziendali per descrivere grandi quantità di dati. Non si riferisce a una quantità specifica di dati, ma descrive piuttosto un set di dati che non può essere archiviato o elaborato utilizzando il software di database tradizionale ."
    },
    {
      "domanda": "Il DNS traduce i nomi di dominio in che tipo di indirizzo ?: \n (a) Host locale \n (b) Nome host \n (c) Indirizzo IP \n (d) Indirizzo MAC \n",
      "risposta": "c",
      "info": "DNS sta per Domain Name System. I nomi di dominio servono come nomi memorizzabili per siti Web e altri servizi su Internet. Tuttavia, i computer accedono ai dispositivi Internet tramite i loro indirizzi IP. Il DNS traduce i nomi di dominio in indirizzi IP, consentendo accedere a una posizione Internet tramite il suo nome di dominio."
    },
    {
      "domanda": "Quale sistema operativo viene utilizzato come base della maggior parte dei sistemi operativi open source ?: \n (a) Linux \n (b) MacOS \n (c) Windows \n (d) BeOS \n",
      "risposta": "a",
      "info": "Linux è un sistema operativo (OS) simile a Unix creato da Linus Torvalds. Ha sviluppato Linux perché non era soddisfatto delle opzioni attualmente disponibili in Unix e sentiva di poterlo migliorare. Quindi ha fatto quello che chiunque altro Quando Linus finì di costruire una versione funzionante di Linux, distribuì liberamente il sistema operativo, il che lo aiutò a guadagnare popolarità. Linux è disponibile in diverse distribuzioni. Alcune delle distribuzioni più popolari includono Red Hat Enterprise, CentOS, Debian, openSUSE e Ubuntu. Linux supporta anche diverse piattaforme hardware, tra cui Intel, PowerPC, DEC Alpha, Sun Sparc e Motorola. Poiché Linux è compatibile con così tanti tipi di hardware, vengono utilizzate variazioni del sistema operativo Linux per molti altri dispositivi elettronici oltre ai computer."
    },
    {
      "domanda": "Quale dei seguenti è generalmente memorizzato nella ROM di un dispositivo hardware ?: \n (a) Spyware \n (b) Freeware \n (c) Shreware \n (d) Firmware \n",
      "risposta": "d",
      "info": "Il firmware è un programma software o un insieme di istruzioni programmate su un dispositivo hardware. Fornisce le istruzioni necessarie su come il dispositivo comunica con l'hardware dell'altro computer. Il firmware è generalmente memorizzato nella ROM flash di un dispositivo hardware. Mentre La ROM è  memoria di sola lettura, la ROM flash può essere cancellata e riscritta perché in realtà è un tipo di memoria flash."
    },
    {
      "domanda": "Che tipo di tecnologia sviluppa e mantiene l'organizzazione MPEG ?: \n (a) Formati di immagine senza perdita \n (b) Formati video compressi \n (c) Protocolli di streaming multimediale \n (d) Standard di videoconferenza \n ",
      "risposta": "b",
      "info": "MPEG sta per Moving Picture Experts Group. MPEG è un'organizzazione che sviluppa standard per la codifica di audio e video digitali. Lavora con l'Organizzazione internazionale per la standardizzazione (ISO) e la Commissione elettrotecnica internazionale (IEC) per garantire gli standard di compressione dei media sono ampiamente adottati e universalmente disponibili."
    },
    {
      "domanda": "Invece di pixel, la grafica vettoriale è composta da cosa ?: \n (a) Punti \n (b) Bitmap \n (c) Blocchi \n (d) Percorsi \n",
      "risposta": "d",
      "info": "A differenza delle immagini JPEG, GIF e BMP, la grafica vettoriale non è composta da una griglia di pixel. Invece, la grafica vettoriale è composta da percorsi, che sono definiti da un punto iniziale e finale, insieme ad altri punti, curve e angoli lungo il percorso. Un tracciato può essere una linea, un quadrato, un triangolo o una forma sinuosa. Questi tracciati possono essere utilizzati per creare disegni semplici o diagrammi complessi. I tracciati possono anche essere utilizzati per definire i caratteri di caratteri tipografici specifici."
    },
    {
      "domanda": "Che tipo di schermo deve essere occasionalmente smagnetizzato ?: \n (a) LCD \n (b) LED \n (c) CRT \n (d) Plasma \n",
      "risposta": "c",
      "info": "La smagnetizzazione è il processo di riduzione di un campo magnetico. Può essere utilizzato per ripristinare il campo magnetico di un monitor CRT o per distruggere i dati su un dispositivo di memorizzazione magnetica. Un monitor CRT visualizza le immagini sparando elettroni attraverso un catodo tubo a raggi (CRT) sullo schermo. I fasci di elettroni sono focalizzati da una piastra vicino allo schermo chiamata maschera d'ombra. Se questa piastra viene magnetizzata in modo non uniforme dagli oggetti circostanti o semplicemente dal campo magnetico terrestre, può causare lo scolorimento dello schermo. Pertanto , I monitor CRT spesso includono un comando Degauss che ripristina il campo magnetico durante l'esecuzione. Poiché è impossibile eliminare la carica magnetica all'interno del monitor, il processo di smagnetizzazione riallinea o randomizza il campo magnetico, che fornisce colori coerenti su tutto lo schermo."
    }
  ]
}